In [1]:
import pandas as pd

# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
series1 = pd.Series([4,8,15,16,23,42])

print(type(series1))
print(series1)

<class 'pandas.core.series.Series'>
0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
numbers=[i for i in range(10,100,10)]

num_series = pd.Series(numbers)

print(num_series)

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data: Then, print the DataFrame.

In [4]:
df = pd.DataFrame(
    {
        'Name':['Alice','Bob','Claire'],
        'Age':[25,30,27],
        'Gender':['Female','Male','Female']
    }
)

print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

## Series 
Pandas series is a one dimensional data structure with key-value pairs where keys are the indices and the calues are values stored at that indices.

In [5]:
fruits = pd.Series(["apples", "oranges", "bananas"])
print(fruits)

0     apples
1    oranges
2    bananas
dtype: object

## Dataframe
Pandas dataframe is a two dimensional data structure that can be considered as collection of two or more series with common indices.

In [7]:
df = pd.DataFrame(
    {
        'Name':['Alice','Bob','Claire','Dan','Effany','Ron','Kara'],
        'Age':[25,30,27,30,21,19,24],
        'Gender':['Female','Male','Female','Male','Female','Male','Female']
    }
)

print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
3     Dan   30    Male
4  Effany   21  Female
5     Ron   19    Male
6    Kara   24  Female

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [8]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
3     Dan   30    Male
4  Effany   21  Female
5     Ron   19    Male
6    Kara   24  Female

In [13]:
# drop - to drop column
df.drop('Gender',axis=1,inplace=True)
df

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27
3     Dan   30
4  Effany   21
5     Ron   19
6    Kara   24

In [14]:
# sort - to sort the values
df.sort_values('Age')
df

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27
3     Dan   30
4  Effany   21
5     Ron   19
6    Kara   24

In [15]:
df['Age']=df['Age'].replace(30,40)
df

     Name  Age
0   Alice   25
1     Bob   40
2  Claire   27
3     Dan   40
4  Effany   21
5     Ron   19
6    Kara   24

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Pandas DataFrame is mutable as we can add or delete , columns and rows in dataframe

Series Objects are value-mutable but size-immutable objects. 
Value-mutable meaning we can change the existing values.
Size-mutable meaning we cannot increase or reduce the size.

Pandas Panel is also mutable.

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [16]:
roll_num = pd.Series([1,2,3])
name=pd.Series(['Rahul','Rajesh','Sama'])
marks=pd.Series([90,89,95])

students = pd.DataFrame({
    'roll_num':roll_num,
    'name':name,
    'marks':marks
})

students

   roll_num    name  marks
0         1   Rahul     90
1         2  Rajesh     89
2         3    Sama     95